app/views/users/_show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 3]]
---
        <h5>Recent posts:</h5>
        <% @user.posts.each do |post| %>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1 ORDER BY created_at desc  [["user_id", 3]]
---
        <div class="recent-comment">
            <% @user.comments.order("created_at desc").each do |comment| %>