app/views/posts/_sidebar.html.erb


        <% if @users = User.order("last_login desc").limit(12) %>
---
SELECT  "users".* FROM "users" ORDER BY last_login desc LIMIT $1  [["LIMIT", 12]]

        <h5>Topic</h5>
        <% Topic.all.order(:name).where.not(name: "News").each do |topic| %>
---
SELECT "topics".* FROM "topics" WHERE "topics"."name" != $1 ORDER BY "topics"."name" ASC  [["name", "News"]]

        <h5>Post</h5>
        <% Post.all.order(view: :desc).limit(5).each do |post| %>
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."view" DESC LIMIT $1  [["LIMIT", 5]]