app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
---
                            <p class="view-count"><span class="glyphicon glyphicon-eye-open"></span><span><%= post.view %></span></p>
                            <p class="comment-count"><span class="glyphicon glyphicon-comment"></span><span><%= post.comments.count %></span></p>