app/views/posts/new.html.erb

SELECT "topics".* FROM "topics"
---
                <span class="field-name input-group-addon" id="basic-addon1">Topic</span>
                <%= select("post",
                    "topic_id",
                    Topic.all.collect {|t| [ t.name, t.id ] },
                    { include_blank: "----- Select -----" },
                    { class: "select-field form-control"})