app/views/posts/show.html.erb

            <p class="topic"><%= @post.topic.name %><p>
            <p class="comment-count count"><span class="glyphicon glyphicon-comment"></span><span><%= @post.comments.count %></span></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

        <div class="post-comments">
            <h4><%= @post.comments.count %> Comments</h4>
            <% if @post.comments.count > 0 %>
                <% @post.comments.each do |comment| %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]