app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (created_at >= '2020-04-30 05:09:48.107255' AND created_at <= '2020-05-30 05:09:48.107603') ORDER BY created_at desc
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" IN ($1, $2)  [["topic_id", 9], ["topic_id", 2]]
---
    def index
        # If keyword is present from the request
        if params[:keyword]
            # Remove all toggled topics
            clearAllToggleTopics
            # Set filter to false (Non toggle) as it is searched by keyword
            filterPost(false)
            # Return the posts that contains the keyword
            return @posts = Post.searchByKeyword(params[:keyword])
        end

        # Else return the recent post
        @posts = Post.all.created_between(1.month.ago, Time.now)
        @users = User.all

        # Return all recent posts if filter post status is false
        return @posts if !currentFilterPostStatus

        # Return all selected posts if filter post status is true
        return @posts = Post.where(topic_id: currentToggledTopics) if currentFilterPostStatus

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "view" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["view", 151], ["updated_at", "2020-05-31 03:07:02.359455"], ["id", 1]]
---
    def show
        @post = Post.find_by(id: params[:id])
        # Update the view if only the post is found
        @post.update_attributes(view: @post.view + 1) if @post

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def view_count
        @post = Post.find_by(id: params[:id])