app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].downcase)

    if (user && user.authenticate(params[:password]))
      log_in user
      params[:remember_me] == '1' ? remember(user) : forget(user)
      # Update user's active login time to so that the home page can display recent members
      user.update_attribute(:last_login, Time.now)
---
UPDATE "users" SET "remember_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["remember_digest", "$2a$04$tM1llFEvhURPiO3pFA8dGuL7lHVeYjhvZVkXEDLlosLiEzKGfydEC"], ["updated_at", "2020-05-30 11:53:41.385008"], ["id", 129232768]]