app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].downcase)

    if (user && user.authenticate(params[:password]))
      log_in user
      params[:remember_me] == '1' ? remember(user) : forget(user)
      # Update user's active login time to so that the home page can display recent members
      user.update_attribute(:last_login, Time.now)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ken@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "last_login" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-30 05:10:02.413943"], ["last_login", "2020-05-30 05:10:02.409938"], ["id", 3]]