app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def update
        topic = Topic.find(params[:id])