app/controllers/users_controller.rb

INSERT INTO "users" ("email", "mobile", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "updated_at" = $1, "last_login" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-30 05:10:33.441858"], ["last_login", "2020-05-30 05:10:33.437410"], ["id", 13]]
---
  def update
    if @user.update_attributes(info_update_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_userid
    @user = User.find(params[:id])