app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 965022582], ["LIMIT", 1]]
---
  def set_userid
    @user = User.find(params[:id])